Revit 2026 API

# RebarBendingDetailAddHosts Method

---
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static void AddHosts(
	Element bendingDetail,
	IList<Reference> references
)
```
```vb
Public Shared Sub AddHosts (
	bendingDetail As Element,
	references As IList(Of Reference)
)
```
```cpp
public:
static void AddHosts(
	Element^ bendingDetail,
	IList<Reference^>^ references
)
```
```fsharp
static member AddHosts :
        bendingDetail : Element *
        references : IList<Reference> -> unit
```

#### Parameters

bendingDetail Element

references IListReference

#### Reference

RebarBendingDetail Class

Autodesk.Revit.DB.Structure Namespace